{
    "skillMetadata": {
        "sections": [
            {
                "name": "Basic Settings",
                "fields": [
                    {
                        "name": "verbose",
                        "type": "checkbox",
                        "label": "Verbose",
                        "value": "false"
		    },
		    {
			"type": "label",
			"name": "verbose_label",
			"label": "<p>If you'd like Mycroft to give a verbal confirmation after you give him a command related to your Philip's Hue lights, check the 'Verbose' box.</p>"
                    },
                    {
                        "name": "brightness_step",
                        "type": "number",
                        "label": "Brightness Step",
                        "value": 50
                    },
                    {
                        "type": "label",
                        "name": "brightness_step_label",
                        "label": "<p>Hue lights have a brightness range of 1-254. The Brightness Step determines how much Mycroft should turn the lights up or down when you ask him to adjust the brightness of your lights.</p>"
                    },
                    {
                        "name": "color_temperature_step",
                        "type": "number",
                        "label": "Color Temperature Step",
                        "value": 1000
                    },
                    {
                        "type": "label",
                        "name": "color_temperature_step_label",
                        "label": "<p>The Color Temperature Step is similar to the Brightness Step, except that it controls how much of an adjustment Mycroft will make to the color temperature of your lights (redness vs white/blueness). The complete range of color temperatures is from 2000 to 6500 (measured in degrees Kelvin).</p>"
                    },
                    {
                        "name": "default_group",
                        "type": "text",
                        "label": "Default Group",
                        "value": 0
                    },
                    {
                        "type": "label",
                        "name": "default_group_label",
                        "label": "<p>Mycroft supports Hue groups, allowing you to request that he adjust a particular set of lights (e.g. those in your kitchen or bedroom), without changing any other lights. The Default Group value determines which group Mycroft will act on by default, when you do not specify a group in your command. The default, 0, is all of your lights. You can use either the name of the group (e.g. \"kitchen\") or it's id (e.g. \"4\").</p>"
                    }
                ]
            },
            {
                "name": "Advanced Settings",
                "fields": [

                    {
                        "name": "ip",
                        "type": "text",
                        "label": "Hub IP Address",
                        "value": ""
                    },
                    {
                        "type": "label",
                        "name": "ip_label",
                        "label": "<p>This field is optional. If it is left blank, Mycroft should automatically discover the Phillips Hue hub on your network. If he has any trouble locating the bridge, however, you can enter the IP address of your hub here.</p>"
                    },
                    {
                        "name": "username",
                        "type": "password",
                        "label": "Username",
                        "value": ""
                    },
                    {
                        "type": "label",
                        "name": "username_label",
                        "label": "<p>This field is optional, and generally doesn't need to be set. Whenever you connect a new application to your Hue hub (i.e. whenever you're instructed to push the button on top of the hub), a unique 'username' (random string of letters/numbers) is generated for that app. The app then uses that value to identify itself going forward. Mycroft is no different, and will ask you to press the button on the bridge on first setup, and should work just fine from then on. If you're a developer, however, and are frequently flashing your Mycroft device with new images, you may get sick of having to register with the bridge over and over. In that case, you may enter a username here. You can use the value Mycroft generates on your first setup (should be found in <i>~mycroft/.mycroft/skills/PhillipsHueSkill/username</i>), or you can generate your own by following the <a href=https://www.developers.meethue.com/documentation/getting-started>meethue developer getting started guide</a>.</p>"
                    }
                ]
            }
        ]
    }
}
